hw4/app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "The Eraser"], ["created_at", "2016-03-18 21:55:12.060088"], ["updated_at", "2016-03-18 21:55:12.060088"]]
---
  def create
    @movie = Movie.create!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 45]]
---
  def destroy
    @movie = Movie.find(params[:id])

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]
---
  def find_by_director
    @movie = Movie.find(params[:id])
    @director = @movie.director
    if @director.blank?
      flash[:warning] = "'#{@movie.title}' has no director info."
      redirect_to(movies_path)
    else
      @movies = @movie.find_movies_by_director